{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 28, 140, 1], "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "conv2d_1", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 32}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 64}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "conv2d_3", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 128}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last"}}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": true, "units": 11, "kernel_regularizer": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": true, "units": 11, "kernel_regularizer": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": true, "units": 11, "kernel_regularizer": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_4", "class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": true, "units": 11, "kernel_regularizer": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_5", "class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": true, "units": 11, "kernel_regularizer": null}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0], ["dense_3", 0, 0], ["dense_4", 0, 0], ["dense_5", 0, 0]], "name": "model_1"}}